---
kind: other
id: Properties.T:Autodesk.Revit.DB.BoundaryValidation
source: html/bbc323eb-9e9f-aa18-28a3-3b9c2b1ff24d.htm
---
# BoundaryValidation Properties

Specifies whether the .NET object represents a valid Revit entity.